
&НаКлиенте
Процедура ЗагрузитьЦеныИзExcel(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаПрайсЛиста.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеЗаписаны" тогда
		Элементы.Список.Обновить();
		Элементы.Список.ВыделенныеСтроки.Количество();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
		Сообщение.Текст = СтрШаблон("Данные обновлены");
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры  



