
Функция userRegistrationPOST(Запрос)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
	ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	НоваяЗапись = Справочники.Контрагенты.СоздатьЭлемент();
	НоваяЗапись.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент");
	НоваяЗапись.КонтактныйТелефон = ДанныеЗапроса.ТелефонКлиента;
	НоваяЗапись.Наименование = ДанныеЗапроса.Клиент;
	НоваяЗапись.Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Клиенты");
	НоваяЗапись.Комментарий = СтрШаблон("Клиент %1 зарегистрирован через мобильное приложение", ДанныеЗапроса.Клиент);	
	
	Попытка
		НоваяЗапись.Записать();
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование = НоваяЗапись.Наименование;
		НовыйПользователь.Клиент = НоваяЗапись.Ссылка;
		НовыйПользователь.Записать();
		ТекстОтвета = "Создан новый пользователь "  + НоваяЗапись.Номер;
		Ответ = Новый HTTPСервисОтвет(200);	
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		ТекстОтвета = "Произошла ошибка при создании пользователя " + НоваяЗапись.Номер + "!";
	КонецПопытки;
	
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
	
	Возврат Ответ;
	
	
КонецФункции
