
&НаКлиенте
Процедура УстановитьВидимость()
Клиент = (Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент"));
Если Клиент Тогда
	Элементы.Наименование.Заголовок = "Ф.И.О.";
Иначе 
	Элементы.Наименование.Заголовок = "Наименование";
КонецЕсли;
Элементы.ДатаРожденияКлиента.Видимость = Клиент;
Элементы.ПолКлиента.Видимость = Клиент;
Элементы.Договор.Видимость = Не Клиент;


КонецПроцедуры // УстановитьВидимость()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


