Функция ПолучитьЦенуПродажиНаДату(Номенклатура, ДатаЦены, ВидЦены = Неопределено)Экспорт 
	Если ВидЦены = Неопределено Тогда 
		ВидЦены = Перечисления.ВидыЦенПродаж.Розничная;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ) КАК ЦеныНоменклатурыСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
	|	И ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены);
	
	РезЗапроса = Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда 
		Сообщить("В базе данных не найдена цена для данной номенклатуры!");
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Цена;
	

КонецФункции // ПолучитьЦенуПродажиНаДату()
