Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	Если ИменаПараметровСеанса <> Неопределено Тогда
		УстановленныеПараметры = Новый Массив;
		Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл 
			УстановитьЗначенияПараметровСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры 


Процедура УстановитьЗначенияПараметровСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ИмяПараметра = "ТекущийПользователь" Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		
		Если ПользовательИБ = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		ТекущийПользователь = Справочники.Пользователи.НайтиПоКоду(ПользовательИБ.УникальныйИдентификатор);
		
		Если ТекущийПользователь.Пустая() Тогда 
			ПользовательОъект = Справочники.Пользователи.СоздатьЭлемент();
			ПользовательОъект.Код = ПользовательИБ.УникальныйИдентификатор;
			ПользовательОъект.Наименование = ПользовательИБ.Имя;
			ПользовательОъект.Записать();
			ТекущийПользователь = ПользовательОъект.Ссылка;
		КонецЕсли;
		
		ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
	КонецЕсли;
	
	УстановленныеПараметры.Добавить(ИмяПараметра);
	
		
	
КонецПроцедуры 