
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(объект.Ответственный) Тогда 
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	ЗаполнитьРеквизитыФормы();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	
	Получатель = Объект.Получатель;
	ВидОперации = Объект.ВидОперации;
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда 
		Объект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя;
	КонецЕсли;
	
	
КонецПроцедуры // ЗаполнитьРеквизитыФормы()

&НаСервереБезКонтекста
Функция ПроверитьВидимостьОтТипаКонтрагента(Получатель)
  Запрос = Новый Запрос;
  Запрос.Текст = 
  "ВЫБРАТЬ
  |	Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
  |	Контрагенты.Ссылка КАК Ссылка
  |ИЗ
  |	Справочник.Контрагенты КАК Контрагенты
  |ГДЕ
  |	Контрагенты.Ссылка = &Получатель";
  
  Запрос.УстановитьПараметр("Получатель", Получатель);
  
  Выборка = Запрос.Выполнить().Выбрать();
  Выборка.Следующий();
  
  Если ЗначениеЗаполнено(Выборка.ТипКонтрагента) И 
	  Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда 
	  Возврат Ложь;
  Иначе
	  Возврат Истина;
  КонецЕсли;
  	
КонецФункции // ПроверитьВидимостьОтТипаКонтрагента()

&НаКлиенте
Процедура УстановитьВидимость()
	
	СтрокаТипПолучателя = "";
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ОплатаПоставщику") Тогда 
		Элементы.Договор.Видимость = Истина;
		СтрокаТипПолучателя = "СправочникСсылка.Контрагенты";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВозвратПокупателю")Тогда 
		Элементы.Договор.Видимость = Ложь;
		СтрокаТипПолучателя = "СправочникСсылка.Контрагенты";
	Иначе
		Элементы.Договор.Видимость = Ложь;
		СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СтрокаТипПолучателя) Тогда 
		Массив = Новый Массив;
		Массив.Добавить(Тип(СтрокаТипПолучателя));                                                  
		ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
		Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;
	КонецЕсли;
	
	

КонецПроцедуры // УстановитьВидимость()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры































