Процедура РассчитатьСуммуНачисления() Экспорт
	ДнейБольничногоЗаСчетРоботодателя = 3;

	Для Каждого Движение Из ЭтотОбъект Цикл 
		Если Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад Тогда 
			Оклад = Движение.ПоказательРасчета;
			ОтработаноЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия).Итог("КоличествоЧасов");
			НормаЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия).Итог("КоличествоЧасов");
			РезультатРасчета = Оклад * ОтработаноЧасов/НормаЧасов;
			Движение.Сумма = РезультатРасчета;
		ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный Тогда 
			Оклад = Движение.ПоказательРасчета;
			СтоимостьДняПоБолезни = Оклад * 24 / 730;
			КоличествоДнейБолезни = (КонецДня(Движение.ПериодДействияКонец) + 1 - Движение.ПериодДействияНачало) / 86400;
			Если КоличествоДнейБолезни <= ДнейБольничногоЗаСчетРоботодателя Тогда 
				РезультатРасчета = КоличествоДнейБолезни * СтоимостьДняПоБолезни;
				ДнейБольничногоЗаСчетРоботодателя = ДнейБольничногоЗаСчетРоботодателя - КоличествоДнейБолезни;
			Иначе
				РезультатРасчета = ДнейБольничногоЗаСчетРоботодателя * СтоимостьДняПоБолезни;
				ДнейБольничногоЗаСчетРоботодателя = 0;
			КонецЕсли;
			Движение.Сумма = РезультатРасчета;
			
		ИначеЕсли Движение.ВидРасчета.Предопределенный = Ложь Тогда 
			РезультатРасчета = Неопределено;
			ФормулаРасчета = Движение.ВидРасчета.ФормулаРасчета;
			Выполнить(ФормулаРасчета);
			Движение.Сумма = РезультатРасчета;
		Иначе
			Движение.Сумма = 0;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = СтрШаблон("Для вида расчета %1 не задана формула расчёта!", Движение.ВидРасчета);
			СообщениеПользователю.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	ЭтотОбъект.Записать(, Истина);
			
КонецПроцедуры // РассчитатьСуммуНачисления()
