
&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	Если ЗначениеЗаполнено(Объект.Номер)
		И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + Объект.Номер + " от " + 
		Формат(Объект.ДатаНачала, "ДЛФ=Д") + " г.";
	ИначеЕсли ЗначениеЗаполнено(Объект.Номер)
		И НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + Объект.Номер;
	Иначе 
		Объект.Наименование = " от " + Формат(Объект.ДатаНачала, "ДЛФ=Д") + " г.";
	КонецЕсли
КонецПроцедуры // СформироватьНаименованиеДоговора() 

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()

     Элементы.ДатаОкончания.Видимость =  Не Объект.Бессрочный;	

 КонецПроцедуры // УстановитьВидимость()

&НаКлиенте
 Процедура ПриОткрытии(Отказ)
	 УстановитьВидимость();
 КонецПроцедуры

&НаКлиенте
 Процедура БессрочныйПриИзменении(Элемент)
	 УстановитьВидимость();
 КонецПроцедуры
 
 



	

