&НаКлиенте
Процедура УстановитьВидимость()

	ЮрЛицо = (Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо"));
	Элементы.ГлавныйБухгалтер.Видимость = ЮрЛицо;
	
КонецПроцедуры // УстановитьВидимость()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если  (Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") И
		СтрДлина(Объект.ИНН) <> 10) Или
		(Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") И
		СтрДлина(Объект.ИНН)<> 12) Тогда
		Сообщить("Неверно указан ИНН");
		Отказ = Истина;
	КонецЕсли;;
	
КонецПроцедуры

